ПочтовыйМодуль/src/InformationRegisters/РеестрУведомлений/РеестрУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрУведомлений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МассивНаименованийФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МассивIDФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МассивТиповФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>массивНаименованиеСсылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>массивСсылок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьОткладыватьНа15</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьОткладыватьНа30</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьОткладыватьНа45</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьОткладыватьНа1час</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDУведмления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТребуетОтправкуНаПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказатьОдинРаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИДатаОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтложенНа</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Опубликовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ПочтовыйМодуль/src/CommonModules/ОтправкаУведомлений/Module.bsl
Функция  ОтправитьУведомления() экспорт
	 Запрос = новый запрос;
	 Запрос.Текст =     "ВЫБРАТЬ
	                    |	РеестрУведомлений.Автор КАК Автор,
	                    |	РеестрУведомлений.Сообщение КАК Сообщение,
	                    |	РеестрУведомлений.Статус КАК Статус,
	                    |	РеестрУведомлений.IDУведмления КАК IDУведмления,
	                    |	ЛОЖЬ КАК прочитан,
	                    |	РеестрУведомлений.ОтложенНа КАК ОтложенНа,
	                    |	РеестрУведомлений.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	                    |	РеестрУведомлений.МассивIDФайлов КАК МассивIDФайлов,
	                    |	РеестрУведомлений.МассивТиповФайлов КАК МассивТиповФайлов,
	                    |	РеестрУведомлений.ПоказатьОдинРаз КАК ПоказатьОдинРаз,
	                    |	РеестрУведомлений.массивНаименованиеСсылки КАК массивНаименованиеСсылки,
	                    |	РеестрУведомлений.массивСсылок КАК массивСсылок,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа15 КАК РазрешитьОткладыватьНа15,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа30 КАК РазрешитьОткладыватьНа30,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа45 КАК РазрешитьОткладыватьНа45,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа1час КАК РазрешитьОткладыватьНа1час
	                    |ПОМЕСТИТЬ ТЗМногоРаз
	                    |ИЗ
	                    |	РегистрСведений.РеестрУведомлений КАК РеестрУведомлений
	                    |ГДЕ
	                    |	РеестрУведомлений.Прочитано = ЛОЖЬ
	                    |	И РеестрУведомлений.Получатель = &Получатель
	                    |	И РеестрУведомлений.ПоказатьОдинРаз = ЛОЖЬ
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	РеестрУведомлений.Автор КАК Автор,
	                    |	РеестрУведомлений.Сообщение КАК Сообщение,
	                    |	РеестрУведомлений.Статус КАК Статус,
	                    |	РеестрУведомлений.IDУведмления КАК IDУведмления,
	                    |	ИСТИНА КАК прочитан,
	                    |	РеестрУведомлений.ОтложенНа КАК ОтложенНа,
	                    |	РеестрУведомлений.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	                    |	РеестрУведомлений.МассивIDФайлов КАК МассивIDФайлов,
	                    |	РеестрУведомлений.МассивТиповФайлов КАК МассивТиповФайлов,
	                    |	РеестрУведомлений.ПоказатьОдинРаз КАК ПоказатьОдинРаз,
	                    |	РеестрУведомлений.массивНаименованиеСсылки КАК массивНаименованиеСсылки,
	                    |	РеестрУведомлений.массивСсылок КАК массивСсылок,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа15 КАК РазрешитьОткладыватьНа15,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа30 КАК РазрешитьОткладыватьНа30,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа45 КАК РазрешитьОткладыватьНа45,
	                    |	РеестрУведомлений.РазрешитьОткладыватьНа1час КАК РазрешитьОткладыватьНа1час
	                    |ПОМЕСТИТЬ тзодинраз
	                    |ИЗ
	                    |	РегистрСведений.РеестрУведомлений КАК РеестрУведомлений
	                    |ГДЕ
	                    |	РеестрУведомлений.Прочитано = ЛОЖЬ
	                    |	И РеестрУведомлений.Получатель = &Получатель
	                    |	И РеестрУведомлений.ПоказатьОдинРаз = ИСТИНА
	                    |	И РеестрУведомлений.ВремяИДатаОповещения <= &ТекущееВремя
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТЗМногоРаз.Автор КАК Автор,
	                    |	ТЗМногоРаз.Сообщение КАК Сообщение,
	                    |	ТЗМногоРаз.Статус КАК Статус,
	                    |	ТЗМногоРаз.IDУведмления КАК IDУведмления,
	                    |	ТЗМногоРаз.прочитан КАК прочитан,
	                    |	ТЗМногоРаз.ОтложенНа КАК ОтложенНа,
	                    |	ТЗМногоРаз.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	                    |	ТЗМногоРаз.МассивIDФайлов КАК МассивIDФайлов,
	                    |	ТЗМногоРаз.МассивТиповФайлов КАК МассивТиповФайлов,
	                    |	ТЗМногоРаз.ПоказатьОдинРаз КАК ПоказатьОдинРаз,
	                    |	ТЗМногоРаз.массивНаименованиеСсылки КАК массивНаименованиеСсылки,
	                    |	ТЗМногоРаз.массивСсылок КАК массивСсылок,
	                    |	ТЗМногоРаз.РазрешитьОткладыватьНа15 КАК РазрешитьОткладыватьНа15,
	                    |	ТЗМногоРаз.РазрешитьОткладыватьНа30 КАК РазрешитьОткладыватьНа30,
	                    |	ТЗМногоРаз.РазрешитьОткладыватьНа45 КАК РазрешитьОткладыватьНа45,
	                    |	ТЗМногоРаз.РазрешитьОткладыватьНа1час КАК РазрешитьОткладыватьНа1час
	                    |ИЗ
	                    |	ТЗМногоРаз КАК ТЗМногоРаз
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	тзодинраз.Автор,
	                    |	тзодинраз.Сообщение,
	                    |	тзодинраз.Статус,
	                    |	тзодинраз.IDУведмления,
	                    |	тзодинраз.прочитан,
	                    |	тзодинраз.ОтложенНа,
	                    |	тзодинраз.МассивНаименованийФайлов,
	                    |	тзодинраз.МассивIDФайлов,
	                    |	тзодинраз.МассивТиповФайлов,
	                    |	тзодинраз.ПоказатьОдинРаз,
	                    |	тзодинраз.массивНаименованиеСсылки,
	                    |	тзодинраз.массивСсылок,
	                    |	тзодинраз.РазрешитьОткладыватьНа15,
	                    |	тзодинраз.РазрешитьОткладыватьНа30,
	                    |	тзодинраз.РазрешитьОткладыватьНа45,
	                    |	тзодинраз.РазрешитьОткладыватьНа1час
	                    |ИЗ
	                    |	тзодинраз КАК тзодинраз" ; 

	 
	 ////"ВЫБРАТЬ
	 ////                 |	РеестрУведомлений.Автор КАК Автор,
	 ////                 |	РеестрУведомлений.Сообщение КАК Сообщение,
	 ////                 |	РеестрУведомлений.Статус КАК Статус,
	 ////                 |	РеестрУведомлений.IDУведмления КАК IDУведмления,
	 ////                 |	ЛОЖЬ КАК прочитан,
	 ////                 |	РеестрУведомлений.ОтложенНа КАК ОтложенНа,
	 ////                 |	РеестрУведомлений.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	 ////                 |	РеестрУведомлений.МассивIDФайлов КАК МассивIDФайлов,
	 ////                 |	РеестрУведомлений.МассивТиповФайлов КАК МассивТиповФайлов,
	 ////                 |	РеестрУведомлений.ПоказатьОдинРаз КАК ПоказатьОдинРаз
	 ////                 |ПОМЕСТИТЬ ТЗМногоРаз
	 ////                 |ИЗ
	 ////                 |	РегистрСведений.РеестрУведомлений КАК РеестрУведомлений
	 ////                 |ГДЕ
	 ////                 |	РеестрУведомлений.Прочитано = ЛОЖЬ
	 ////                 |	И РеестрУведомлений.Получатель = &Получатель
	 ////                 |	И РеестрУведомлений.ПоказатьОдинРаз = ЛОЖЬ
	 ////                 |;
	 ////                 |
	 ////                 |////////////////////////////////////////////////////////////////////////////////
	 ////                 |ВЫБРАТЬ
	 ////                 |	РеестрУведомлений.Автор КАК Автор,
	 ////                 |	РеестрУведомлений.Сообщение КАК Сообщение,
	 ////                 |	РеестрУведомлений.Статус КАК Статус,
	 ////                 |	РеестрУведомлений.IDУведмления КАК IDУведмления,
	 ////                 |	ИСТИНА КАК прочитан,
	 ////                 |	РеестрУведомлений.ОтложенНа КАК ОтложенНа,
	 ////                 |	РеестрУведомлений.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	 ////                 |	РеестрУведомлений.МассивIDФайлов КАК МассивIDФайлов,
	 ////                 |	РеестрУведомлений.МассивТиповФайлов КАК МассивТиповФайлов,
	 ////                 |	РеестрУведомлений.ПоказатьОдинРаз КАК ПоказатьОдинРаз
	 ////                 |ПОМЕСТИТЬ тзодинраз
	 ////                 |ИЗ
	 ////                 |	РегистрСведений.РеестрУведомлений КАК РеестрУведомлений
	 ////                 |ГДЕ
	 ////                 |	РеестрУведомлений.Прочитано = ЛОЖЬ
	 ////                 |	И РеестрУведомлений.Получатель = &Получатель
	 ////                 |	И РеестрУведомлений.ПоказатьОдинРаз = ИСТИНА
	 ////                 |	И РеестрУведомлений.ВремяИДатаОповещения <= &ТекущееВремя
	 ////                 |;
	 ////                 |
	 ////                 |////////////////////////////////////////////////////////////////////////////////
	 ////                 |ВЫБРАТЬ
	 ////                 |	ТЗМногоРаз.Автор КАК Автор,
	 ////                 |	ТЗМногоРаз.Сообщение КАК Сообщение,
	 ////                 |	ТЗМногоРаз.Статус КАК Статус,
	 ////                 |	ТЗМногоРаз.IDУведмления КАК IDУведмления,
	 ////                 |	ТЗМногоРаз.прочитан КАК прочитан,
	 ////                 |	ТЗМногоРаз.ОтложенНа КАК ОтложенНа,
	 ////                 |	ТЗМногоРаз.МассивНаименованийФайлов КАК МассивНаименованийФайлов,
	 ////                 |	ТЗМногоРаз.МассивIDФайлов КАК МассивIDФайлов,
	 ////                 |	ТЗМногоРаз.МассивТиповФайлов КАК МассивТиповФайлов,
	 ////                 |	ТЗМногоРаз.ПоказатьОдинРаз КАК ПоказатьОдинРаз
	 ////                 |ИЗ
	 ////                 |	ТЗМногоРаз КАК ТЗМногоРаз
	 ////                 |
	 ////                 |ОБЪЕДИНИТЬ ВСЕ
	 ////                 |
	 ////                 |ВЫБРАТЬ
	 ////                 |	тзодинраз.Автор,
	 ////                 |	тзодинраз.Сообщение,
	 ////                 |	тзодинраз.Статус,
	 ////                 |	тзодинраз.IDУведмления,
	 ////                 |	тзодинраз.прочитан,
	 ////                 |	тзодинраз.ОтложенНа,
	 ////                 |	тзодинраз.МассивНаименованийФайлов,
	 ////                 |	тзодинраз.МассивIDФайлов,
	 ////                 |	тзодинраз.МассивТиповФайлов,
	 ////                 |	тзодинраз.ПоказатьОдинРаз
	 ////                 |ИЗ
	 ////                 |	тзодинраз КАК тзодинраз" ; 
	 запрос.УстановитьПараметр("Получатель", ПараметрыСеанса.ТекущийПользователь);
	 запрос.УстановитьПараметр("ТекущееВремя", ТекущаяДата());
	 
	 результат = запрос.Выполнить().Выгрузить();   
	 
	 
	 ВыходнаяСтруктура = Новый Структура;
	 
	 Для каждого СтрокаТЗ Из результат Цикл
		 
		 СтруктураСтроки = Новый Структура;
		Для каждого Колонка Из результат.Колонки Цикл
		    СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
		КонецЦикла;
		
		ВыходнаяСтруктура.Вставить("Строка" + результат.Индекс(СтрокаТЗ), СтруктураСтроки);
	КонецЦикла;
	 
	 
	возврат ВыходнаяСтруктура; 
	 
	 
КонецФункции


Функция ПроверитьВключениеУведомлений() экспорт
	   возврат Константы.ВключитьУведомления.Получить();
   КонецФункции          
   
   функция получитьЗначениеИнтервалаУведомлений() экспорт
	   
	   возврат Константы.ИнтервалУведомлений.Получить();
	   КонецФункции 
	   
	   
	   
	   
	   Процедура ЗавестиМассивУведомлений(IDУведмления) экспорт 
			    мас1 = новый массив;
			   попытка
				   для каждого стр из ПараметрыСеанса.IDОповещений цикл
					 мас1.Добавить(стр);
					 КонецЦикла;
		   исключение
			  
		   КонецПопытки;
		   
			   мас1.Добавить(IDУведмления);
				                             			    
				ПараметрыСеанса.IDОповещений = Новый ФиксированныйМассив(мас1);     
			    
			    
		КонецПроцедуры
		
		
		функция ПроверитьОткрытаЛиФормаУведомления(IDУведмления) экспорт
			     формаОткрыта = ложь;
				 
				 попытка
				 для каждого стр из ПараметрыСеанса.IDОповещений цикл
					 если стр=IDУведмления тогда
						 формаОткрыта = истина;
						 Прервать;
						 КонецЕсли;
					 КонецЦикла;  
					 
					
				 исключение
				 КонецПопытки;   
				 
				  возврат формаОткрыта;
			КонецФункции
